#+title:     Exercises in SICP Chapter 2
#+author:    Jason Huang
#+email:     huangmianrui0310@outlook.com
#+date:      <2021-04-08 Thu>

#+description:  Exercises and solutions in SICP chapter 2
#+keywords:     sicp, exercises, solutions, lisp, scheme
#+language:     en
#+startup:      content
#+exclude_tags: noexport

#+LATEX_HEADER: \usepackage{tikz}
#+PROPERTY: header-args:latex :headers '("\\usepackage{tikz}") :fit yes :imagemagick yes :iminoptions -density 300 :imoutoptions
#+OPTIONS: tex:imagemagick

*** Solution

#+name: better-make-rat
#+begin_src scheme :exports none
(define (make-rat n d)
  (let ((g (gcd n d))
        (denom-sign (if (> d 0) 1 (- 1))))
    (cons (* (/ n g) denom-sign)
          (* (/ d g) denom-sign))))
#+end_src

#+name: solution2.1
#+begin_src scheme
<<better-make-rat>>
(define (numer x) (car x))
(define (denom x) (cdr x))
(define (print-rat x)
  (display (numer x))
  (display "/")
  (display (denom x))
  (newline))

(print-rat (make-rat 2 -4))
(print-rat (make-rat -2 4))
#+end_src

#+RESULTS: solution2.1
: -1/2
: -1/2

**** First representation for rectangles

#+name: rectangle-constructor-selectors-a
#+begin_src scheme :exports none
(define (make-rectangle left top width height angle)
  (cons (make-point left top)
        (cons (cons width height)
              angle)))
(define (rec-origin r) (car r))
(define (rec-width r) (car (car (cdr r))))
(define (rec-height r) (cdr (car (cdr r))))
(define (rec-angle r) (cdr (cdr r)))
#+end_src

#+name: perimeter-area-rectangle
#+begin_src scheme :exports none
(define (perimeter r)
  (* (+ (rec-width r) (rec-height r)) 2))
(define (area r)
  (* (rec-width r) (rec-height r)))
#+end_src

#+name: test-solution-2.3-a
#+begin_src scheme
<<point-constructor-selectors>>

<<rectangle-constructor-selectors-a>>

<<perimeter-area-rectangle>>

(define r (make-rectangle 1 1 4.0 5.0 0.2))
(display "Rectangle a: ") (newline)
(display (format "Perimeter: ~s~n" (perimeter r)))
(display (format "Area: ~s~n" (area r)))
#+end_src

#+RESULTS: test-solution-2.3-a
: Rectangle a:
: Perimeter: 18.0
: Area: 20.0

**** Second representation of rectangles

#+name: rectangle-helpers
#+begin_src scheme :exports none
(define (distance-points p0 p1)
  (sqrt
   (+ (sqr (- (x-point p0) (x-point p1)))
      (sqr (- (y-point p0) (y-point p1))))))

(define (dot-product p0 p1)
  (+ (* (x-point p0) (x-point p1))
     (* (y-point p0) (y-point p1))))

(define (vec-add v0 v1)
  (make-point (+ (x-point v0) (x-point v1))
              (+ (y-point v0) (y-point v1))))

(define (vec-sub v0 v1)
  (make-point (- (x-point v0) (x-point v1))
              (- (y-point v0) (y-point v1))))

(define (orthogonal? v0 v1)
  (= 0.0 (dot-product v0 v1))) ; should it be better with an small range?
#+end_src

#+name: rectangle-constructor-selectors-b
#+begin_src scheme :exports none
; Constructor
(define (make-rectangle p0 p1 p2)
  (if (orthogonal? (vec-sub p1 p0) (vec-sub p2 p0))
      (cons p0 (cons p1 p2))
      (error "Points should make an rectangle.")))

; Selectors
(define (rec-height r) (distance-points (car r) (car (cdr r))))
(define (rec-width r) (distance-points (car r) (cdr (cdr r))))
#+end_src

#+name: test-solution-2.3-b
#+begin_src scheme
<<point-constructor-selectors>>

<<rectangle-helpers>>

<<rectangle-constructor-selectors-b>>

<<perimeter-area-rectangle>>

(define p0 (make-point 0 0))
(define p1 (make-point 10 -2))
(define p2 (make-point 1 5))
(define r (make-rectangle p0 p1 p2))

(display "Rectangle b: ") (newline)
(display (format "Perimeter: ~s~n" (perimeter r)))
(display (format "Area: ~s~n" (area r)))
#+end_src

#+RESULTS: test-solution-2.3-b
: Rectangle b:
: Perimeter: 30.594117081556707
: Area: 51.99999999999999

*** Solution

#+name: cons-car-cdr-definitions
#+begin_src scheme :exports none
(define (cons a b)
  (* (expt 2 a) (expt 3 b)))

(define (car z)
  (define (car-iter a count)
    (if (= (remainder a 2) 0)
        (car-iter (/ a 2) (+ count 1))
        count))
  (car-iter z 0))

(define (cdr z)
  (define (cdr-iter b count)
    (if (= (remainder b 3) 0)
        (cdr-iter (/ b 3) (+ count 1))
        count))
  (cdr-iter z 0))
#+end_src

#+name: test-solution-2.5
#+begin_src scheme
<<cons-car-cdr-definitions>>

(define z (cons 4 2))
(display z) (newline)
(display (car z)) (newline)
(display (cdr z)) (newline)
(newline)
(define z (cons 3 4))
(display z) (newline)
(display (car z)) (newline)
(display (cdr z)) (newline)
#+end_src

#+RESULTS: test-solution-2.5
: 144
: 4
: 2
:
: 648
: 3
: 4

*** Solution

#+name: evaluate-use-substitution
#+begin_src scheme
(add-1 zero)                                                          ;0
(add-1 (lambda (f) (lambda (x) x)))                                   ;1
((lambda (f) (lambda (x) (f ((n f) x)))) (lambda (f) (lambda (x) x))) ;2
((lambda (f) (lambda (x) (f (((lambda (f) (lambda (x) x)) f) x)))))   ;3
((lambda (f) (lambda (x) (f ((lambda (x) x) x)))))                    ;4
((lambda (f) (lambda (x) (f x))))                                     ;5
#+end_src

#+name: church-numerals-one
#+begin_src scheme :exports none
(define one (lambda (f) (lambda (x) (f x))))
#+end_src

#+name: church-numerals-two
#+begin_src scheme :exports none
(define two (lambda (f) (lambda (x) (f (f x)))))
#+end_src

#+name: church-numerals-add
#+begin_src scheme :exports none
(define (add a b)
  (lambda (f) (lambda (x) ((a f) ((b f) x)))))
#+end_src

#+name: test-solution-2.6
#+begin_src scheme
<<church-numerals-one>>
<<church-numerals-two>>
<<church-numerals-add>>
(define three (lambda (f) (lambda (x) (f (f (f x))))))

(define (inc x) (+ x 1))

(display ((one inc) 0)) (newline)
(display ((two inc) 0)) (newline)
(display ((three inc) 0))  (newline)
(display (((add one two) inc) 0)) (newline)
(display (((add three two) inc) 0)) (newline)
#+end_src

#+RESULTS: test-solution-2.6
: 1
: 2
: 3
: 3
: 5

**** Multiplication

One possible case, if all number are > 1

\begin{align*}
z_{lower}&=x_{lower}*y_{lower} \\
z_{upper}&=x_{upper}*y_{upper} \\
2\cdot z_{width} &= z_{upper}-z_{lower} = (x_{upper}*y_{upper})-(x_{lower}*y_{lower}) \\
&\neq(2\cdot x_{width})*(2\cdot y_{width}) \\
z_{width}&\neq x_{width}*y_{width}
\end{align*}

Example:

#+begin_src scheme
<<alyssa-constructor-selectors>>

(define r1 (make-interval 100.0 101.0))
(define r2 (make-interval 22.0 23.0))
(display (format "r1 = ~a~n" (width-interval r1)))
(display (format "r2 = ~a~n" (width-interval r2)))
(display (format "mul = ~a~n" (width-interval (mul-interval r1 r2))))
(display (format "div = ~a~n" (width-interval (div-interval r1 r2))))
#+end_src

#+RESULTS:
: r1 = 0.5
: r2 = 0.5
: mul = 61.5
: div = 0.12154150197628466

*** Solution

#+name: improve-alyssa-div-interval
#+begin_src scheme :exports none
(define (div-interval x y)
  (if (<= (* (lower-bound y) (upper-bound y)) 0)
      (error "Division error (interval spans 0)" y)
      (mul-interval
       x
       (make-interval (/ 1.0 (upper-bound y))
                      (/ 1.0 (lower-bound y))))))
#+end_src

#+name: test-solution-2.10
#+begin_src scheme
<<alyssa-constructor-selectors>>

<<improve-alyssa-div-interval>>

(define x (make-interval 2 7))
(define y (make-interval 8 3))
(define span-0 (make-interval -1 1))
(print-interval "x/y" (div-interval x y))
(print-interval "x/span-0" (div-interval x span-0))
#+end_src

#+RESULTS: test-solution-2.10
: x/y => [0.25, 2.333333333333333]
: Division error (interval spans 0) (-1 . 1)
:

*** Solution

As we can figure out, every interval has three combinations of two endpoints. So if we calculate the production of two intervals, we should evaluate nine cases below:

| No. | x0 (lower bound) | x1 (upper bound) | y0 (lower bound) | y1 (upper bound) | production                                                            |
|-----+------------------+------------------+------------------+------------------+-----------------------------------------------------------------------|
|   1 | non-negative     | non-negative     | non-negative     | non-negative     | ~(make-interval (* x0 y0) (* x1 y1))~                                 |
|   2 | negative         | non-negative     | non-negative     | non-negative     | ~(make-interval (* x0 y1) (* x1 y1))~                                 |
|   3 | negative         | negative         | non-negative     | non-negative     | ~(make-interval (* x0 y1) (* x1 y0))~                                 |
|   4 | non-negative     | non-negative     | negative         | non-negative     | ~(make-interval (* x1 y0) (* x1 y1))~                                 |
|   5 | negative         | non-negative     | negative         | non-negative     | ~(make-interval (min (* x0 y1) (* x1 y0)) (max (* x0 y0) (* x1 y1)))~ |
|   6 | negative         | negative         | negative         | non-negative     | ~(make-interval (* x0 y1) (* x1 y0))~                                 |
|   7 | non-negative     | non-negative     | negative         | negative         | ~(make-interval (* x1 y0) (* x0 y1))~                                 |
|   8 | negative         | non-negative     | negative         | negative         | ~(make-interval (* x1 y0) (* x0 y0))~                                 |
|   9 | negative         | negative         | negative         | negative         | ~(make-interval (* x1 y1) (* x0 y0))~                                 |

#+name: mul-interval-using-bens-suggestion
#+begin_src scheme :exports none
(define (non-negative? n) (not (negative? n)))
(define (mul-interval x y)
  (let ((x0 (lower-bound x))
        (x1 (upper-bound x))
        (y0 (lower-bound y))
        (y1 (upper-bound y)))
    (cond ((non-negative? y0)
           (cond ((non-negative? x0) (make-interval (* x0 y0) (* x1 y1)))
                 ((non-negative? x1) (make-interval (* x0 y1) (* x1 y1)))
                 (else (make-interval (* x0 y1) (* x1 y0)))))
          ((non-negative? y1)
           (cond ((non-negative? x0) (make-interval (* x1 y0) (* x1 y1)))
                 ((non-negative? x1) (make-interval (min (* x0 y1) (* x1 y0)) (max (* x0 y0) (* x1 y1))))
                 (else (make-interval (* x0 y1) (* x0 y0)))))
          (else
           (cond ((non-negative? x0) (make-interval (* x1 y0) (* x0 y1)))
                 ((non-negative? x1) (make-interval (* x1 y0) (* x0 y0)))
                 (else (make-interval (* x1 y1) (* x0 y0))))))))
#+end_src

#+name: test-solution-2.11
#+begin_src scheme
<<alyssa-constructor-selectors>>

<<mul-interval-using-bens-suggestion>>

(define two-positives (make-interval 1 2))
(define negative-positive (make-interval -1 1))
(define two-negatives (make-interval -2 -1))

; Test [+, +] * [+, +]
(print-interval "[+1, +2] * [+1, +2]" (mul-interval two-positives two-positives))
; Test [-, +] * [+, +]
(print-interval "[-1, +1] * [+1, +2]" (mul-interval negative-positive two-positives))
; Test [-, -] * [+, +]
(print-interval "[-2, -1] * [+1, +2]" (mul-interval two-negatives two-positives))
; Test [+, +] * [-, +]
(print-interval "[+1, +2] * [-1, +1]" (mul-interval two-positives negative-positive))
; Test [-, +] * [-, +]
(print-interval "[-1, +1] * [-1, +1]" (mul-interval negative-positive negative-positive))
; Test [-, -] * [-, +]
(print-interval "[-2, -1] * [-1, +1]" (mul-interval two-negatives negative-positive))
; Test [+, +] * [-, -]
(print-interval "[+1, +2] * [-2, -1]" (mul-interval two-positives two-negatives))
; Test [-, +] * [-, -]
(print-interval "[-1, +1] * [-2, -1]" (mul-interval negative-positive two-negatives))
; Test [-, -] * [-, -]
(print-interval "[-2, -1] * [-2, -1]" (mul-interval two-negatives two-negatives))
#+end_src

#+RESULTS: test-solution-2.11
: [+1, +2] * [+1, +2] => [1, 4]
: [-1, +1] * [+1, +2] => [-2, 2]
: [-2, -1] * [+1, +2] => [-4, -1]
: [+1, +2] * [-1, +1] => [-2, 2]
: [-1, +1] * [-1, +1] => [-1, 1]
: [-2, -1] * [-1, +1] => [-2, 2]
: [+1, +2] * [-2, -1] => [-4, -1]
: [-1, +1] * [-2, -1] => [-2, 2]
: [-2, -1] * [-2, -1] => [1, 4]

*** Solution

#+name: make-center-percent
#+begin_src scheme :exports none
(define (make-center-percent c p)
  (let ((width (* c (/ p 100.0))))
    (make-interval (- c width) (+ c width))))

(define (center i)
  (/ (+ (lower-bound i) (upper-bound i)) 2))

(define (width i)
  (/ (- (upper-bound i) (lower-bound i)) 2))

(define (percent i)
  (* (/ (width i) (center i)) 100))

(define (print-center-percent name i)
  (printf "~a => ~a ± ~a%~n" name (center i) (percent i)))
#+end_src

#+name: test-solution-2.12
#+begin_src scheme
<<alyssa-constructor-selectors>>

<<make-center-percent>>

(define i (make-center-percent 10 50))
(print-center-percent "i" i)
#+end_src

#+RESULTS: test-solution-2.12
: i => 10.0 ± 50.0%

*** Solution

We can assume two intervals are $a$ and $b$. Their centers are $C_a$ and $C_b$. Tolerances are $T_a$ and $T_b$. So we have these expressions below:

\begin{align*}
a&=[C_a\cdot(1-T_a),\:C_a\cdot(1+T_a)] \\
b&=[C_b\cdot(1-T_b),\:C_b\cdot(1+T_b)]
\end{align*}

And we also can assume all numbers are positive to simplifying the problem. Now the product of $a$ and $b$ is:

\begin{align*}
a\cdot b&=[C_a\cdot(1-T_a)\cdot C_b\cdot(1-T_b),\:C_a\cdot(1+T_a)\cdot C_b\cdot(1+T_b)] \\
&=[C_a\cdot C_b\cdot(1-T_a-T_b+T_a\cdot T_b),\:C_a\cdot C_b\cdot(1+T_a+T_b+T_a\cdot T_b)] \\
&=[C_a\cdot C_b\cdot\left(1-(T_a+T_b)+T_a\cdot T_b\right),\:C_a\cdot C_b\cdot\left(1+(T_a+T_b)+T_a\cdot T_b\right)]
\end{align*}

Both $T_a$ and $T_b$ are small percentage tolerances, their product will be a wee number that can be ignored. So we have a new expression now:

\begin{align*}
a\cdot b=[C_a\cdot C_b\cdot(1 - (T_a+T_b)),\:C_a\cdot C_b\cdot(1 + (T_a+T_b))]
\end{align*}

So, it appears that for small tolerances, the tolerance of the product will be approximately the sum of the component tolerances.

Write an example to verify:

#+name: test-solution-2.13
#+begin_src scheme
<<alyssa-constructor-selectors>>

<<make-center-percent>>

(define x (make-center-percent 16 1))
(define y (make-center-percent 16 2))
(printf "~a ≈ 1 + 2~n" (percent (mul-interval x y)))
#+end_src

#+RESULTS: test-solution-2.13
: 2.9994001199760074 ≈ 1 + 2

*** Solution

#+name: test-solution-2.14
#+begin_src scheme
<<alyssa-constructor-selectors>>

<<make-center-percent>>

<<lem-two-programs>>

(define A (make-center-percent 100 1))
(define B (make-center-percent 150 2))

(print-interval "A" A)
(print-interval "B" B)
(print-center-percent "A" A)
(print-center-percent "B" B)
(print-center-percent "(par1 A A)" (par1 A A))
(print-center-percent "(par2 A A)" (par2 A A))
(print-center-percent "(par1 A B)" (par1 A B))
(print-center-percent "(par2 A B)" (par2 A B))
(print-center-percent "(par1 B B)" (par1 B B))
(print-center-percent "(par2 B B)" (par2 B B))
(print-center-percent "A/A" (div-interval A A))
(print-center-percent "A/B" (div-interval A B))
(print-center-percent "B/A" (div-interval B A))
(print-center-percent "B/B" (div-interval B B))
#+end_src

#+RESULTS: test-solution-2.14
#+begin_example
A => [99.0, 101.0]
B => [147.0, 153.0]
A => 100.0 ± 1.0%
B => 150.0 ± 2.0%
(par1 A A) => 50.02000200020002 ± 2.999200239928031%
(par2 A A) => 50.0 ± 1.000000000000007%
(par1 A B) => 60.05617438064145 ± 4.597193908142474%
(par2 A B) => 59.99855963126561 ± 1.400072020165649%
(par1 B B) => 75.12004801920769 ± 5.993607670795042%
(par2 B B) => 75.0 ± 2.0%
A/A => 1.0002000200020003 ± 1.9998000199980077%
A/B => 0.6670668267306923 ± 2.999400119976001%
B/A => 1.5004500450045004 ± 2.9994001199760123%
B/B => 1.0008003201280513 ± 3.9984006397441028%
#+end_example

*** Solution

#+name: last-pair-procedure
#+begin_src scheme :exports none
(define (last-pair l)
  (define (iter pairs last)
    (if (null? pairs)
        last
        (iter (cdr pairs) (list (car pairs)))))
  (iter l '()))
#+end_src

#+name: test-solution-2.17
#+begin_src scheme
<<last-pair-procedure>>

(printf "~a~n" (last-pair (list 23 72 149 34)))
(printf "~a~n" (last-pair '()))
#+end_src

#+RESULTS: test-solution-2.17
: (34)
: ()

#+name: recursive-last-pair
#+begin_src scheme :exports none
(define (last-pair l)
  (let ((remains (cdr l)))
    (if (null? remains)
        l
        (last-pair remains))))
#+end_src

#+name: test-recursive-last-pair
#+begin_src scheme
<<recursive-last-pair>>

(printf "~a~n" (last-pair (list 23 72 149 34)))
#+end_src

#+RESULTS: test-recursive-last-pair
: (34)

*** Solution

#+name: reverse-list-procedure
#+begin_src scheme :exports none
(define (reverse l)
  (define (iter items result)
    (if (null? items)
        result
        (iter (cdr items) (cons (car items) result))))
  (iter l '()))
#+end_src

#+name: test-solution-2.18
#+begin_src scheme
<<reverse-list-procedure>>

(printf "~a~n" (reverse (list 1 4 9 16 25)))
#+end_src

#+RESULTS: test-solution-2.18
: (25 16 9 4 1)

#+name: recursive-reverse-list
#+begin_src scheme :exports none
(define (reverse l)
  (if (null? l)
      l
      (append (reverse (cdr l)) (list (car l)))))
#+end_src

#+name: test-recursive-reverse-list
#+begin_src scheme
<<recursive-reverse-list>>

(printf "~a~n" (reverse (list 1 4 9 16 25)))
#+end_src

#+RESULTS: test-recursive-reverse-list
: (25 16 9 4 1)

*** Solution

#+name: first-denomination-procedure
#+begin_src scheme :exports none
(define first-denomination car)
#+end_src

#+name: except-first-denomination-procedure
#+begin_src scheme :exports none
(define except-first-denomination cdr)
#+end_src

#+name: no-more-predicate
#+begin_src scheme :exports none
(define no-more? null?)
#+end_src

#+name: test-solution-2.19
#+begin_src scheme
<<two-currency>>

<<new-cc-program>>

<<new-cc-program>>

<<first-denomination-procedure>>

<<except-first-denomination-procedure>>

<<no-more-predicate>>

(printf "~a~n" (cc 100 us-coins))
(printf "~a~n" (cc 64 uk-coins))
(printf "~a~n" (cc 100 (list 1 5 10 25 50)))
(printf "~a~n" (cc 100 (list 5 1 10 25 50)))
(printf "~a~n" (cc 100 (list 5 25 1 50 10)))
#+end_src

#+RESULTS: test-solution-2.19
: 292
: 15962
: 292
: 292
: 292

The order of the list ~coin-values~ doesn't affect the answer. Because the procedure computes all possible combinations.

*** Solution 2.20

#+name: same-parity-procedure
#+begin_src scheme :exports none
(define (same-parity first . rest)
  (let ((same? (if (even? first) even? odd?)))
    (define (iter items result)
      (if (null? items)
          result
          (iter (cdr items)
                (append result
                        (if (same? (car items))
                            (list (car items)) '())))))
    (iter rest (list first))))
#+end_src

#+name: test-solution-2.20
#+begin_src scheme
<<same-parity-procedure>>

(printf "~a~n" (same-parity 1 2 3 4 5 6 7))
(printf "~a~n" (same-parity 2 3 4 5 6 7))
#+end_src

#+RESULTS: test-solution-2.20
: (1 3 5 7)
: (2 4 6)

*** Solution

#+name: square-list-without-map
#+begin_src scheme :exports none
(define (square-list items)
  (if (null? items)
      nil
      (cons ((lambda (x) (* x x)) (car items))
            (square-list (cdr items)))))
#+end_src

#+name: square-list-with-map
#+begin_src scheme :exports none
(define (square-list items)
  (map (lambda (x) (* x x)) items))
#+end_src

#+name: test-solution-2.21
#+begin_src scheme
(define nil '())
<<square-list-without-map>>

(printf "~a~n" (square-list (list 1 2 3 4)))

<<square-list-with-map>>

(printf "~a~n" (square-list (list 1 2 3 4)))
#+end_src

#+RESULTS: test-solution-2.21
: (1 4 9 16)
: (1 4 9 16)

*** Solution

#+begin_src scheme
(display (list 1 (list 2 (list 3 4))))
#+end_src

#+RESULTS:
: (1 (2 (3 4)))

#+name: box-and-pointer-notation
#+begin_example
+---+---+  +---+---+
| * | *-+->| * | / |
+-+-+---+  +-+-+---+
  |          |
  V          V
+---+      +---+---+  +---+---+
| 1 |      | * | *-+->| * | / |
+---+      +-+-+---+  +-+-+---+
             |          |
             V          V
           +---+      +---+---+  +---+---+
           | 2 |      | * | *-+->| * | / |
           +---+      +-+-+---+  +-+-+---+
                        |          |
                        V          V
                      +---+      +---+
                      | 3 |      | 4 |
                      +---+      +---+
#+end_example

#+name: tree-notation
#+begin_example
(1 (2 (3 4)))
     ^
   /   \
  1     ^ (2 (3 4))
      /   \
     2     ^ (3 4)
         /   \
        3     4
#+end_example

*** Solution

#+name: pick-seven-procedure
#+begin_src scheme
(define (pick-seven items)
  (cond ((null? items) -1)
        ((not (pair? items))
         (if (= items 7) 7 -1))
        ((= (pick-seven (car items)) 7) 7)
        (else (pick-seven (cdr items)))))
#+end_src

#+name: test-solution-2.25
#+begin_src scheme
<<pick-seven-procedure>>

(printf "~a~n" (pick-seven (list 1 3 (list 5 7) 9)))
(printf "~a~n" (pick-seven (list (list 7))))
(printf "~a~n" (pick-seven (list 1 (list 2 (list 3 (list 4 (list 5 (list 6 7))))))))
#+end_src

#+RESULTS: test-solution-2.25
: 7
: 7
: 7

#+name: solution-from-schemewiki
#+begin_src scheme
; create a procedure from a string (using the same format as "cadr", "caaddr", etc)
(define (cxxr str)
  (define (recur str lst)
    (let ((first (string-ref str 0))
          (rest (substring str 1)))
      (cond ((eq? first #\a)
             (car (recur rest lst)))
            ((eq? first #\d)
             (cdr (recur rest lst)))
            ((eq? first #\r)
             lst)
            (else (error "Unrecognizable symbol:" str)))))
  (lambda (lst)
    (if (eq? (string-ref str 0) #\c)
        (recur (substring str 1) lst)
        (error "Unrecognizable symbol:" str))))

; find an atom a in the list l and give the string representing the procedure to pick a
(define (find a l)
  (define (searcher l)
    (cond ((null? l) #f)
          ((not (pair? l))
           (if (eq? a l)
               ""
               #f))
          (else (let ((a (searcher (car l)))
                      (d (searcher (cdr l))))
                  (cond (a (string-append a "a"))
                        (d (string-append d "d"))
                        (else #f))))))
  (string-append "c" (searcher l) "r"))
#+end_src

#+name: test-solution-from-schemewiki
#+begin_src scheme
<<solution-from-schemewiki>>

(display ((cxxr (find 7 '(1 3 (5 7) 9))) '(1 3 (5 7) 9)))
#+end_src

#+RESULTS: test-solution-from-schemewiki
: 7

*** Solution

#+name: deep-reverse-procedure
#+begin_src scheme
(define (deep-reverse items)
  (cond ((null? items) items)
        (else
         (map (lambda (x) (if (pair? x) (deep-reverse x) x)) (reverse items)))))
#+end_src

#+name: test-solution-2.27
#+begin_src scheme
<<reverse-list-procedure>>

<<deep-reverse-procedure>>

(define x '((1 2) (3 4)))
(define y '((1 2) ((3 4) ((5 6) (7 8)))))
(define z '((1 2) (3 (4 5)) ((2 3) 3)))

(printf "~a~n" (deep-reverse x))
(printf "~a~n" (deep-reverse y))
(printf "~a~n" (deep-reverse z))
#+end_src

#+RESULTS: test-solution-2.27
: ((4 3) (2 1))
: ((((8 7) (6 5)) (4 3)) (2 1))
: ((3 (3 2)) ((5 4) 3) (2 1))

*** Solution

#+name: fringe-procedure
#+begin_src scheme
(define (fringe tree)
  (define nil '())
  (define (iter subtree result)
    (if (null? subtree)
        result
        (let ((first (car subtree))
              (res (cdr subtree)))
          (if (pair? first)
              (append (iter first result) (iter res result))
              (cons first (iter res result))))))
  (iter tree nil))
#+end_src

#+name: test-solution-2.28
#+begin_src scheme
<<fringe-procedure>>

(define x '((1 2) (3 4)))
(printf "~a~n" (fringe x))
(printf "~a~n" (fringe (list x x)))
#+end_src

#+RESULTS: test-solution-2.28
: (1 2 3 4)
: (1 2 3 4 1 2 3 4)

#+name: recursive-fringe-procedure
#+begin_src scheme
(define (fringe tree)
  (define nil '())
  (if (null? tree)
      nil
      (if (pair? tree)
          (append (fringe (car tree)) (fringe (cdr tree)))
          (list tree))))
#+end_src

#+name: test-recursive-fringe-procedure
#+begin_src scheme
<<recursive-fringe-procedure>>

(define x '((1 2) (3 4)))
(printf "~a~n" (fringe x))
(printf "~a~n" (fringe (list x x)))
#+end_src

#+RESULTS: test-recursive-fringe-procedure
: (1 2 3 4)
: (1 2 3 4 1 2 3 4)

**** Total weight of a mobile

#+name: total-weight-procedure
#+begin_src scheme
(define (total-weight m)
  (define (branch-weight b)
    (if (null? b)
        0
        (let ((st (branch-structure b)))
          (if (pair? st) (total-weight st) st))))
  (if (null? m)
      0
      (+ (branch-weight (left-branch m))
         (branch-weight (right-branch m)))))
#+end_src

#+name: test-total-weight-procedure
#+begin_src scheme
<<make-mobile-based-on-list>>

<<make-branch-based-on-list>>

<<mobile-branch-selectors>>

<<total-weight-procedure>>

(define m (make-mobile
           (make-branch 1 (make-mobile
                           (make-branch 3 15)
                           (make-branch 4 20)))
           (make-branch 2 (make-mobile
                           (make-branch 5 (make-mobile
                                           (make-branch 6 25)
                                           (make-branch 7 30)))
                           (make-branch 8 10)))))

(printf "~a~n" (total-weight m))
#+end_src

#+RESULTS: test-total-weight-procedure
: 100

**** Balanced binary mobile

#+name: balanced-mobile-predicate
#+begin_src scheme
(define (balanced? m)
  (define (torque b)
    (let ((len (branch-length b))
          (st (branch-structure b)))
      (* len ((if (pair? st) total-weight identity) st))))
  (if (not (pair? m))
      #t
      (let ((left (left-branch m))
            (right (right-branch m)))
        (if (= (torque left) (torque right))
            (and (balanced? (branch-structure left))
                 (balanced? (branch-structure right)))
            #f))))
#+end_src

#+name: test-balanced-predicate
#+begin_src scheme
<<make-mobile-based-on-list>>

<<make-branch-based-on-list>>

<<mobile-branch-selectors>>

<<total-weight-procedure>>

<<balanced-mobile-predicate>>

(define (test-balanced m)
  (printf "~a~n" (if (balanced? m) "Yes" "No")))

(test-balanced (make-mobile
                (make-branch 1 2)
                (make-branch 2 1)))
(test-balanced (make-mobile
                (make-branch 1 (make-mobile
                                (make-branch 2 3)
                                (make-branch 4 5)))
                (make-branch 5 (make-mobile
                                (make-branch 4 3)
                                (make-branch 2 1)))))
#+end_src

#+RESULTS: test-balanced-predicate
: Yes
: No

**** New representation

#+name: new-selectors
#+begin_example
             right      structure
  +---+---+  +---+---+  +---+
->| * | *-+->| * | *-+->| s |
  +-+-+---+  +-+-+---+  +---+
    |          |
    |          V length
    |        +---+
    |        | l |
    V left   +---+
  +---+---+  +---+ structure
  | * | *-+->| s |
  +-+-+---+  +---+
    |
    V length
  +---+
  | l |
  +---+
#+end_example


#+name: selectors-new-representation
#+begin_src scheme
(define (right-branch m) (cdr m))
(define (branch-structure b) (cdr b))
#+end_src

#+name: test-new-selectors
#+begin_src scheme
<<constructors-based-on-cons>>

<<mobile-branch-selectors>>

<<total-weight-procedure>>

<<selectors-new-representation>>

(define m (make-mobile
           (make-branch 1 (make-mobile
                           (make-branch 3 15)
                           (make-branch 4 20)))
           (make-branch 2 (make-mobile
                           (make-branch 5 (make-mobile
                                           (make-branch 6 25)
                                           (make-branch 7 30)))
                           (make-branch 8 10)))))

(printf "~a~n" (total-weight m))
#+end_src

#+RESULTS: test-new-selectors
: 100

*** Solution

#+name: square-tree-directly
#+begin_src scheme
(define (square-tree tree)
  (define nil '())
  (define (square x) (* x x))
  (cond ((null? tree) nil)
        ((not (pair? tree)) (square tree))
        (else (cons (square-tree (car tree))
                    (square-tree (cdr tree))))))
#+end_src

#+name: test-square-tree
#+begin_src scheme
<<square-tree-directly>>

(display (square-tree
          (list 1
                (list 2 (list 3 4) 5)
                (list 6 7))))
#+end_src

#+RESULTS: test-square-tree
: (1 (4 (9 16) 25) (36 49))

#+name: square-tree-with-map
#+begin_src scheme
(define (square-tree tree)
  (define nil '())
  (define (square x) (* x x))
  (map (lambda (sub-tree)
         (if (pair? sub-tree)
             (square-tree sub-tree)
             (square sub-tree)))
       tree))
#+end_src

#+name: test-square-tree-with-map
#+begin_src scheme
<<square-tree-with-map>>

(display (square-tree
          (list 1
                (list 2 (list 3 4) 5)
                (list 6 7))))
#+end_src

#+RESULTS: test-square-tree-with-map
: (1 (4 (9 16) 25) (36 49))

*** Solution

#+name: tree-map-directly
#+begin_src scheme
(define (tree-map proc tree)
  (define nil '())
  (cond ((null? tree) nil)
        ((not (pair? tree)) (proc tree))
        (else (cons (tree-map proc (car tree))
                    (tree-map proc (cdr tree))))))
#+end_src

#+name: test-tree-map
#+begin_src scheme
<<tree-map-directly>>

<<square-tree-with-tree-map>>

(define (square x) (* x x))

(display (square-tree
          (list 1
                (list 2 (list 3 4) 5)
                (list 6 7))))
#+end_src

#+RESULTS: test-tree-map
: (1 (4 (9 16) 25) (36 49))

#+name: tree-map-with-map
#+begin_src scheme
(define (tree-map proc tree)
  (map (lambda (sub-tree)
         (if (pair? sub-tree)
             (tree-map proc sub-tree)
             (proc sub-tree)))
       tree))
#+end_src

#+name: test-tree-map-with-map
#+begin_src scheme
<<tree-map-with-map>>

<<square-tree-with-tree-map>>

(define (square x) (* x x))

(display (square-tree
          (list 1
                (list 2 (list 3 4) 5)
                (list 6 7))))
#+end_src

#+RESULTS: test-tree-map-with-map
: (1 (4 (9 16) 25) (36 49))

*** Solution

The set of all subsets of a given set is the union of:

- the set of all subsets excluding the first element
- the set of all subsets excluding the first element, with the first element re-inserted into each subset

#+name: diagram-subset
#+begin_example
(subsets '(1 2 3))                             = '(() (3) (2) (2 3) (1) (1 3) (1 2) (1 2 3))
      /   \                                        ↑ '(() (3) (2) (2 3)) + '((1) (1 3) (1 2) (1 2 3))
     1     (subsets '(2 3))                    = '(() (3) (2) (2 3))
                 /   \                             ↑ '(() (3)) + '((2) (2 3))
                2     (subsets '(3))           = '(() (3))
                            /   \                  ↑ '(()) + '((3))
                           3     (subsets '()) = '(())
#+end_example


#+name: subsets-procedure
#+begin_src scheme
(define (subsets s)
  (define nil '())
  (if (null? s)
      (list nil)
      (let ((rest (subsets (cdr s))))
        (append rest
                (map (lambda (set) (append (list (car s)) set))
                     rest)))))
#+end_src

#+name: test-subsets-procedure
#+begin_src scheme
<<subsets-procedure>>

(display (subsets '(1 2 3)))
#+end_src

#+RESULTS: test-subsets-procedure
: (() (3) (2) (2 3) (1) (1 3) (1 2) (1 2 3))

*** Solution

#+name: accumulate-procedure
#+begin_src scheme
(define (accumulate op initial sequence)
  (if (null? sequence)
      initial
      (op (car sequence)
          (accumulate op initial (cdr sequence)))))
#+end_src

#+name: list-manipulation-accumulations
#+begin_src scheme
(define (map p sequence)
  (define nil '())
  (accumulate (lambda (x y) (cons (p x) y)) nil sequence))
(define (append seq1 seq2)
  (accumulate cons seq2 seq1))
(define (length sequence)
  (accumulate (lambda (x y) (+ 1 y)) 0 sequence))
#+end_src

#+name: test-list-manipulations
#+begin_src scheme
<<accumulate-procedure>>
<<list-manipulation-accumulations>>

(define seq '(1 2 3 4 5 6))
(printf "~a~n" (map (lambda (x) (* x x)) seq))
(printf "~a~n" (append seq '(7 8 9 10)))
(printf "~a~n" (length seq))
#+end_src

#+RESULTS: test-list-manipulations
: (1 4 9 16 25 36)
: (1 2 3 4 5 6 7 8 9 10)
: 6

*** Solution

#+name: horner-eval-procedure
#+begin_src scheme
<<accumulate-procedure>>
(define (horner-eval x coefficient-sequence)
  (accumulate (lambda (this-coeff higher-terms)
                (+ (* higher-terms x) this-coeff))
              0
              coefficient-sequence))
#+end_src

#+name: test-horner-eval-procedure
#+begin_src scheme
<<horner-eval-procedure>>

(display (horner-eval 2 (list 1 3 0 5 0 1)))
#+end_src

#+RESULTS: test-horner-eval-procedure
: 79

*** Solution

#+name: redefine-count-leaves
#+begin_src scheme
<<accumulate-procedure>>
(define (count-leaves t)
  (accumulate + 0 (map (lambda (x) (if (not (pair? x)) 1 (count-leaves x))) t)))
#+end_src

#+name: test-redefine-count-leaves
#+begin_src scheme
<<redefine-count-leaves>>

(define x '((1 2) 3 4))
(display (count-leaves x)) (newline)
(display (count-leaves (list x x)))
#+end_src

#+RESULTS: test-redefine-count-leaves
: 4
: 8

*** Solution

#+name: accumulate-n-procedure
#+begin_src scheme
<<accumulate-procedure>>

(define (accumulate-n op init seqs)
  (define nil '())
  (if (null? (car seqs))
      nil
      (cons (accumulate op init (map car seqs))
            (accumulate-n op init (map cdr seqs)))))
#+end_src

#+name: test-accumulate-n-procedure
#+begin_src scheme
<<accumulate-n-procedure>>

(define s '((1 2 3) (4 5 6) (7 8 9) (10 11 12)))
(display (accumulate-n + 0 s))
#+end_src

#+RESULTS: test-accumulate-n-procedure
: (22 26 30)

*** Solution

#+name: matrix-operations
#+begin_src scheme
<<accumulate-n-procedure>>

<<dot-product-procedure>>
(define (matrix-*-vector m v)
  (map (lambda (row) (dot-product row v)) m))
(define (transpose mat)
  (accumulate-n cons '() mat))
(define (matrix-*-matrix m n)
  (let ((cols (transpose n)))
    (map (lambda (row)
           (map (lambda (col)
                  (dot-product row col))
                cols))
         m)))
#+end_src

#+name: test-matrix-operations
#+begin_src scheme
<<matrix-operations>>

(define m '((1 2 3 4) (4 5 6 6) (6 7 8 9)))
(define n '((1 2 3) (4 5 6) (7 8 9) (0 0 0)))
(define v '(1 2 3 4))
(define w '(5 6 7 8))

(printf "~a~n" (dot-product v w))
(printf "~a~n" (matrix-*-vector m v))
(printf "~a~n" (transpose m))
(printf "~a~n" (matrix-*-matrix m n))
#+end_src

#+RESULTS: test-matrix-operations
: 70
: (30 56 80)
: ((1 4 6) (2 5 7) (3 6 8) (4 6 9))
: ((30 36 42) (66 81 96) (90 111 132))

*** Solution

#+begin_src scheme
(fold-right / 1 (list 1 2 3))
3/2
(fold-left / 1 (list 1 2 3))
1/6
(fold-right list nil (list 1 2 3))
(1 (2 (3 ())))
(fold-left list nil (list 1 2 3))
(((() 1) 2) 3)
#+end_src

#+name: verify-example-results
#+begin_src scheme
<<fold-procedures>>

(define nil '())

(printf "~a~n" (fold-right / 1 (list 1 2 3)))
(printf "~a~n" (fold-left / 1 (list 1 2 3)))
(printf "~a~n" (fold-right list nil (list 1 2 3)))
(printf "~a~n" (fold-left list nil (list 1 2 3)))
(printf "~a~n" (fold-right + 0 (list 1 2 3 4)))
(printf "~a~n" (fold-left + 0 (list 1 2 3 4)))
#+end_src

#+RESULTS: verify-example-results
: 3/2
: 1/6
: (1 (2 (3 ())))
: (((() 1) 2) 3)
: 10
: 10

*** Solution

#+name: reverse-fold-procedures
#+begin_src scheme
<<fold-procedures>>
(define nil '())
(define (reverse-use-fold-right sequence)
  (fold-right
   (lambda (current result)
     (append result (list current)))
   nil
   sequence))
(define (reverse-use-fold-left sequence)
  (fold-left
   (lambda (result current)
     (cons current result))
   nil
   sequence))
#+end_src

#+name: test-reverse-fold-procedures
#+begin_src scheme
<<reverse-fold-procedures>>

(define s '(1 2 3 4 5 6 7 8))
(printf "~a~n" (reverse-use-fold-right s))
(printf "~a~n" (reverse-use-fold-left s))
#+end_src

#+RESULTS: test-reverse-fold-procedures
: (8 7 6 5 4 3 2 1)
: (8 7 6 5 4 3 2 1)

*** Solution

#+name: flatmap-procedure
#+begin_src scheme
<<accumulate-procedure>>
(define (flatmap proc seq)
  (accumulate append '() (map proc seq)))
#+end_src

#+name: enumerate-interval-procedure
#+begin_src scheme
(define (enumerate-interval low high)
  (if (> low high)
      '()
      (cons low (enumerate-interval (+ low 1) high))))
#+end_src

#+name: unique-pairs-procedure
#+begin_src scheme
(define (unique-pairs n)
  (flatmap
   (lambda (i)
     (map (lambda (j) (list i j))
          (enumerate-interval 1 (- i 1))))
   (enumerate-interval 1 n)))
#+end_src

#+name: make-pair-sum-procedure
#+begin_src scheme
(define (make-pair-sum pair)
  (list (car pair) (cadr pair) (+ (car pair) (cadr pair))))
#+end_src

#+name: prime-predicate
#+begin_src scheme
(define (prime? x)
  (define (square n) (* n n))
  (define (test divisor)
    (cond ((> (square divisor) x) true)
          ((= 0 (remainder x divisor)) false)
          (else (test (+ divisor 1)))))
  (test 2))
#+end_src

#+name: prime-sum-predicate
#+begin_src scheme
(define (prime-sum? pair)
  (prime? (+ (car pair) (cadr pair))))
#+end_src

#+name: prime-sum-pairs-procedure
#+begin_src scheme
<<flatmap-procedure>>
<<enumerate-interval-procedure>>
<<unique-pairs-procedure>>
<<make-pair-sum-procedure>>
<<prime-predicate>>
<<prime-sum-predicate>>
(define (prime-sum-pairs n)
  (map make-pair-sum (filter prime-sum? (unique-pairs n))))
#+end_src

#+name: test-solution-2.40
#+begin_src scheme
<<prime-sum-pairs-procedure>>

(display (prime-sum-pairs 6))
#+end_src

#+RESULTS: test-solution-2.40
: ((2 1 3) (3 2 5) (4 1 5) (4 3 7) (5 2 7) (6 1 7) (6 5 11))

*** Solution

#+name: ordered-triples-sum-procedure
#+begin_src scheme
<<flatmap-procedure>>
<<enumerate-interval-procedure>>
(define (unique-triples n)
  (flatmap (lambda (k)
             (flatmap (lambda (j)
                        (map (lambda (i) (list i j k))
                             (enumerate-interval 1 (- j 1))))
                      (enumerate-interval 2 (- k 1))))
           (enumerate-interval 3 n)))
(define (ordered-triples-sum n s)
  (filter (lambda (triple) (= (accumulate + 0 triple) s))
          (unique-triples n)))
#+end_src

#+name: test-solution-2.41
#+begin_src scheme
<<ordered-triples-sum-procedure>>

(printf "~a~n" (ordered-triples-sum 10 10))
#+end_src

#+RESULTS: test-solution-2.41
: ((2 3 5) (1 4 5) (1 3 6) (1 2 7))

#+name: solution-2.41-from-schemewiki
#+begin_src scheme
(define (unique-tuples n k)
  (define nil '())
  (cond ((< n k) nil)
        ((= k 0) (list nil))
        (else (append (unique-tuples (- n 1) k)
                      (map (lambda (tuple) (cons n tuple))
                           (unique-tuples (- n 1) (- k 1)))))))
(define (ordered-triples-sum n s)
  (filter (lambda (triple) (= (accumulate + 0 triple) s))
          (unique-tuples n 3)))
#+end_src

#+name: test-solution-2.41-from-schemewiki
#+begin_src scheme
<<accumulate-procedure>>
<<solution-2.41-from-schemewiki>>

(printf "~a~n" (ordered-triples-sum 10 10))
#+end_src

#+RESULTS: test-solution-2.41-from-schemewiki
: ((5 3 2) (5 4 1) (6 3 1) (7 2 1))

*** Solution

#+name: board-representation
#+begin_example
Representation in diagram

  Column 1   Column 2   Column 3   Column 4      Column 8
  +---+---+  +---+---+  +---+---+  +---+---+     +---+---+
->| * | *-+->| * | *-+->| * | *-+->| * | *-+-...>| * | / |
  +-+-+---+  +-+-+---+  +-+-+---+  +-+-+---+     +-+-+---+
    |          |          |          |             |
    V          V          V          V             V
  +---+      +---+      +---+      +---+         +---+
  | 3 |      | 7 |      | 2 |      | 8 |         | 6 |
  +---+      +---+      +---+      +---+         +---+

Representation in Scheme code
'(3 7 2 8 ... 6)
#+end_example

#+name: adjoin-position-procedure
#+begin_src scheme
(define (adjoin-position new-row k rest-of-queens)
  (append rest-of-queens (list new-row)))
#+end_src

#+name: empty-board
#+begin_src scheme
(define empty-board '())
#+end_src

#+name: diagonal-safe-diagram
#+begin_example
The same right diagonal means that row number minus column number is the same result.
    1      2     3     4     5     6     7     8
  +-----+-----+-----+-----+-----+-----+-----+-----+
1 |  0  |  -1 |  -2 |  -3 |  -4 |  -5 |  -6 |  -7 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
2 |  1  |  0  |  -1 |  -2 |  -3 |  -4 |  -5 |  -6 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
3 |  2  |  1  |  0  |  -1 |  -2 |  -3 |  -4 |  -5 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
4 |  3  |  2  |  1  |  0  |  -1 |  -2 |  -3 |  -4 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
5 |  4  |  3  |  2  |  1  |  0  |  -1 |  -2 |  -3 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
6 |  5  |  4  |  3  |  2  |  1  |  0  |  -1 |  -2 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
7 |  6  |  5  |  4  |  3  |  2  |  1  |  0  |  -1 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
8 |  7  |  6  |  5  |  4  |  3  |  2  |  1  |  0  |
  +-----+-----+-----+-----+-----+-----+-----+-----+

The same left diagonal means that row number add column number is the same result.
    1      2     3     4     5     6     7     8
  +-----+-----+-----+-----+-----+-----+-----+-----+
1 |  2  |  3  |  4  |  5  |  6  |  7  |  8  |  9  |
  +-----+-----+-----+-----+-----+-----+-----+-----+
2 |  3  |  4  |  5  |  6  |  7  |  8  |  9  |  10 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
3 |  4  |  5  |  6  |  7  |  8  |  9  |  10 |  11 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
4 |  5  |  6  |  7  |  8  |  9  |  10 |  11 |  12 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
5 |  6  |  7  |  8  |  9  |  10 |  11 |  12 |  13 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
6 |  7  |  8  |  9  |  10 |  11 |  12 |  13 |  14 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
7 |  8  |  9  |  10 |  11 |  12 |  13 |  14 |  15 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
8 |  9  |  10 |  11 |  12 |  13 |  14 |  15 |  16 |
  +-----+-----+-----+-----+-----+-----+-----+-----+
#+end_example

#+name: safe-predicate
#+begin_src scheme
(define (safe? k positions)
  (define (get-row c position)
    (cond ((null? position) -1)
          ((= c 1) (car position))
          (else (get-row (- c 1) (cdr position)))))
  (define (row-safe? c position)
    (cond ((= c 0) #t)
          ((= (get-row k position) (get-row c position)) #f)
          (else (row-safe? (- c 1) position))))
  (define (diagonal-safe? c position)
    (let ((r (get-row k position))
          (other (get-row c position)))
      (cond ((= c 0) #t)
            ((= (- r k) (- other c)) #f)
            ((= (+ r k) (+ other c)) #f)
            (else (diagonal-safe? (- c 1) position)))))
  (and (row-safe? (- k 1) positions)
       (diagonal-safe? (- k 1) positions)))
#+end_src

#+name: test-solution-2.42
#+begin_src scheme
<<flatmap-procedure>>
<<enumerate-interval-procedure>>

<<adjoin-position-procedure>>
<<empty-board>>
<<safe-predicate>>
<<queens-procedure>>

(define all-solutions (queens 8))
(printf "Total: ~a~n" (length all-solutions)) ;; must as 92
(define (print-positions positions)
  (cond ((null? positions) (newline))
        (else (printf "~n~a" (car positions))
              (print-positions (cdr positions)))))
(print-positions all-solutions)
#+end_src

#+RESULTS: test-solution-2.42
#+begin_example
Total: 92

(1 5 8 6 3 7 2 4)
(1 6 8 3 7 4 2 5)
(1 7 4 6 8 2 5 3)
(1 7 5 8 2 4 6 3)
(2 4 6 8 3 1 7 5)
(2 5 7 1 3 8 6 4)
(2 5 7 4 1 8 6 3)
(2 6 1 7 4 8 3 5)
(2 6 8 3 1 4 7 5)
(2 7 3 6 8 5 1 4)
(2 7 5 8 1 4 6 3)
(2 8 6 1 3 5 7 4)
(3 1 7 5 8 2 4 6)
(3 5 2 8 1 7 4 6)
(3 5 2 8 6 4 7 1)
(3 5 7 1 4 2 8 6)
(3 5 8 4 1 7 2 6)
(3 6 2 5 8 1 7 4)
(3 6 2 7 1 4 8 5)
(3 6 2 7 5 1 8 4)
(3 6 4 1 8 5 7 2)
(3 6 4 2 8 5 7 1)
(3 6 8 1 4 7 5 2)
(3 6 8 1 5 7 2 4)
(3 6 8 2 4 1 7 5)
(3 7 2 8 5 1 4 6)
(3 7 2 8 6 4 1 5)
(3 8 4 7 1 6 2 5)
(4 1 5 8 2 7 3 6)
(4 1 5 8 6 3 7 2)
(4 2 5 8 6 1 3 7)
(4 2 7 3 6 8 1 5)
(4 2 7 3 6 8 5 1)
(4 2 7 5 1 8 6 3)
(4 2 8 5 7 1 3 6)
(4 2 8 6 1 3 5 7)
(4 6 1 5 2 8 3 7)
(4 6 8 2 7 1 3 5)
(4 6 8 3 1 7 5 2)
(4 7 1 8 5 2 6 3)
(4 7 3 8 2 5 1 6)
(4 7 5 2 6 1 3 8)
(4 7 5 3 1 6 8 2)
(4 8 1 3 6 2 7 5)
(4 8 1 5 7 2 6 3)
(4 8 5 3 1 7 2 6)
(5 1 4 6 8 2 7 3)
(5 1 8 4 2 7 3 6)
(5 1 8 6 3 7 2 4)
(5 2 4 6 8 3 1 7)
(5 2 4 7 3 8 6 1)
(5 2 6 1 7 4 8 3)
(5 2 8 1 4 7 3 6)
(5 3 1 6 8 2 4 7)
(5 3 1 7 2 8 6 4)
(5 3 8 4 7 1 6 2)
(5 7 1 3 8 6 4 2)
(5 7 1 4 2 8 6 3)
(5 7 2 4 8 1 3 6)
(5 7 2 6 3 1 4 8)
(5 7 2 6 3 1 8 4)
(5 7 4 1 3 8 6 2)
(5 8 4 1 3 6 2 7)
(5 8 4 1 7 2 6 3)
(6 1 5 2 8 3 7 4)
(6 2 7 1 3 5 8 4)
(6 2 7 1 4 8 5 3)
(6 3 1 7 5 8 2 4)
(6 3 1 8 4 2 7 5)
(6 3 1 8 5 2 4 7)
(6 3 5 7 1 4 2 8)
(6 3 5 8 1 4 2 7)
(6 3 7 2 4 8 1 5)
(6 3 7 2 8 5 1 4)
(6 3 7 4 1 8 2 5)
(6 4 1 5 8 2 7 3)
(6 4 2 8 5 7 1 3)
(6 4 7 1 3 5 2 8)
(6 4 7 1 8 2 5 3)
(6 8 2 4 1 7 5 3)
(7 1 3 8 6 4 2 5)
(7 2 4 1 8 5 3 6)
(7 2 6 3 1 4 8 5)
(7 3 1 6 8 5 2 4)
(7 3 8 2 5 1 6 4)
(7 4 2 5 8 1 3 6)
(7 4 2 8 6 1 3 5)
(7 5 3 1 6 8 2 4)
(8 2 4 1 7 5 3 6)
(8 2 5 3 1 7 4 6)
(8 3 1 6 2 5 7 4)
(8 4 1 3 6 2 7 5)
#+end_example

*** Solution

#+name: vect-constructor-and-selectors
#+begin_src scheme
(define (make-vect x y) (cons x y))
(define xcor-vect car)
(define ycor-vect cdr)
#+end_src

#+name: vector-operations
#+begin_src scheme
(define (add-vect v1 v2)
  (make-vect (+ (xcor-vect v1) (xcor-vect v2))
             (+ (ycor-vect v1) (ycor-vect v2))))
(define (sub-vect v1 v2)
  (make-vect (- (xcor-vect v1) (xcor-vect v2))
             (- (ycor-vect v1) (ycor-vect v2))))
(define (scale-vect s v)
  (make-vect (* s (xcor-vect v)) (* s (ycor-vect v))))
#+end_src

#+name: test-solution-2.46
#+begin_src scheme
<<vect-constructor-and-selectors>>
<<vector-operations>>

(define (print-vect v)
  (printf "(~a, ~a)~n" (xcor-vect v) (ycor-vect v)))

(define v1 (make-vect 0 1))
(define v2 (make-vect 1 2))
(print-vect v1)
(print-vect v2)
(print-vect (add-vect v1 v2))
(print-vect (sub-vect v1 v2))
(print-vect (scale-vect 3 v1))
(print-vect (scale-vect 3 v2))
#+end_src

#+RESULTS: test-solution-2.46
: (0, 1)
: (1, 2)
: (1, 3)
: (-1, -1)
: (0, 3)
: (3, 6)

*** Solution

#+name: equal-procedure
#+begin_src scheme
(define (equal? a b)
  (cond ((and (not (pair? a)) (not (pair? b)))
         (eq? a b))
        ((and (pair? a) (pair? b))
         (and (equal? (car a) (car b))
              (equal? (cdr a) (cdr b))))
        (else false)))
#+end_src

#+name: test-solution-2.54
#+begin_src scheme
<<equal-procedure>>

(printf "~a~n" (equal? '(this is a list) '(this is a list)))
(printf "~a~n" (equal? '(this is a list) '(this (is a) list)))
(printf "~a~n" (equal? 'list 'list))
(printf "~a~n" (equal? 'list 'abcd))
(printf "~a~n" (equal? '() '()))
(printf "~a~n" (equal? '() '(1 2 3)))
#+end_src

#+RESULTS: test-solution-2.54
: #t
: #f
: #t
: #f
: #t
: #f

*** Solution

#+name: exponentiation-procedures
#+begin_src scheme
(define (exponentiation? x) (and (pair? x) (eq? (car x) '**)))
(define (base e) (cadr e))
(define (exponent e) (caddr e))
(define (make-exponentiation b pow)
  (cond ((=number? pow 0) 1)
        ((=number? pow 1) b)
        ((and (number? b) (number? pow)) (expt b pow))
        (else (list '** b pow))))
(define (deriv exp var)
  (cond ((number? exp) 0)
        ((variable? exp) (if (same-variable? exp var) 1 0))
        ((sum? exp) (make-sum (deriv (addend exp) var)
                              (deriv (augend exp) var)))
        ((product? exp)
         (make-sum
           (make-product (multiplier exp)
                         (deriv (multiplicand exp) var))
           (make-product (deriv (multiplier exp) var)
                         (multiplicand exp))))
        ((exponentiation? exp)
         (make-product
          (make-product (exponent exp)
                        (make-exponentiation (base exp)
                                             (make-sum (exponent exp) '-1)))
          (deriv (base exp) var)))
        (else
         (error "unknown expresison type: DERIV" exp))))
#+end_src

#+name: algebraic-expressions
#+begin_src scheme
(define variable? symbol?)
(define (same-variable? v1 v2)
  (and (variable? v1) (variable? v2) (eq? v1 v2)))
(define (=number? exp num) (and (number? exp) (= exp num)))
(define (make-sum a1 a2)
  (cond ((=number? a1 0) a2)
        ((=number? a2 0) a1)
        ((and (number? a1) (number? a2))
         (+ a1 a2))
        (else (list '+ a1 a2))))
(define (make-product m1 m2)
  (cond ((or (=number? m1 0) (=number? m2 0)) 0)
        ((=number? m1 1) m2)
        ((=number? m2 1) m1)
        ((and (number? m1) (number? m2)) (* m1 m2))
        (else (list '* m1 m2))))
(define (sum? x) (and (pair? x) (eq? (car x) '+)))
(define (addend s) (cadr s))
(define (augend s) (caddr s))
(define (product? x) (and (pair? x) (eq? (car x) '*)))
(define (multiplier s) (cadr s))
(define (multiplicand s) (caddr s))
(define (deriv exp var)
  (cond ((number? exp) 0)
        ((variable? exp) (if (same-variable? exp var) 1 0))
        ((sum? exp) (make-sum (deriv (addend exp) var)
                              (deriv (augend exp) var)))
        ((product? exp)
         (make-sum
           (make-product (multiplier exp)
                         (deriv (multiplicand exp) var))
           (make-product (deriv (multiplier exp) var)
                         (multiplicand exp))))
        (else
         (error "unknown expresison type: DERIV" exp))))
#+end_src

#+name: test-solution-2.56
#+begin_src scheme
<<algebraic-expressions>>
<<exponentiation-procedures>>

(display (deriv '(+ (** x (* x 2)) x) 'x))
#+end_src

#+RESULTS: test-solution-2.56
: (+ (* (* x 2) (** x (+ (* x 2) -1))) 1)

*** Solution

#+name: handle-arbitrary-arguments
#+begin_src scheme
(define (handle-arbitrary-arguments base init-var)
  (define (handle a1 a2 . rest)
    (let ((rest-length (length rest)))
      (if (= 0 rest-length)
          (base a1 a2)
          (handle (base a1 a2)
                  (if (= 1 rest-length)
                      (base init-var (car rest))
                      (apply handle rest))))))
  handle)
(define (second-factor exp calculator)
  (let ((res (cddr exp)))
    (if (= (length res) 1)
        (car res)
        (apply calculator res))))
#+end_src

#+name: arbitrary-terms-deriv
#+begin_src scheme
<<handle-arbitrary-arguments>>
(define make-sum
  (handle-arbitrary-arguments
   (lambda (a1 a2)
     (cond ((=number? a1 0) a2)
           ((=number? a2 0) a1)
           ((and (number? a1) (number? a2)) (+ a1 a2))
           (else (list '+ a1 a2))))
   0))
(define (augend s) (second-factor s make-sum))

(define make-product
  (handle-arbitrary-arguments
   (lambda (m1 m2)
     (cond ((or (=number? m1 0) (=number? m2 0)) 0)
           ((=number? m1 1) m2)
           ((=number? m2 1) m1)
           ((and (number? m1) (number? m2)) (* m1 m2))
           (else (list '* m1 m2))))
   1))
(define (multiplicand p) (second-factor p make-product))
#+end_src

#+name: test-solution-2.57
#+begin_src scheme
<<algebraic-expressions>>
<<arbitrary-terms-deriv>>

(printf "~a~n" (deriv '(* (* x y) (+ x 3)) 'x))
(printf "~a~n" (deriv '(* x y (+ x 3)) 'x))
#+end_src

#+RESULTS: test-solution-2.57
: (+ (* x y) (* y (+ x 3)))
: (+ (* x y) (* y (+ x 3)))

**** Two arguments and fully parenthesized

#+name: two-arguments-infix-operators
#+begin_src scheme
; Predicates
(define (sum? x) (and (pair? x) (eq? (cadr x) '+)))
(define (product? x) (and (pair? x) (eq? (cadr x) '*)))
; Selectors
(define (addend s) (car s))
(define (augend s) (caddr s))
(define (multiplier s) (car s))
(define (multiplicand s) (caddr s))
; Constructors
(define (make-sum a1 a2)
  (cond ((=number? a1 0) a2)
        ((=number? a2 0) a1)
        ((and (number? a1) (number? a2))
         (+ a1 a2))
        (else (list a1 '+ a2))))
(define (make-product m1 m2)
  (cond ((or (=number? m1 0) (=number? m2 0)) 0)
        ((=number? m1 1) m2)
        ((=number? m2 1) m1)
        ((and (number? m1) (number? m2)) (* m1 m2))
        (else (list m1 '* m2))))
#+end_src

#+name: test-solution-2.58-a
#+begin_src scheme
<<algebraic-expressions>>
<<two-arguments-infix-operators>>

(display (deriv '(x + (3 * (x + (y + 2)))) 'x))
#+end_src

#+RESULTS: test-solution-2.58-a
: 4

**** Drops unnecessary parentheses

#+name: drops-unnecessary-parentheses
#+begin_src scheme
; Predicates
(define (sum? x) (and (pair? x) (eq? (cadr x) '+)))
(define (product? x) (and (pair? x) (eq? (cadr x) '*)))
; Selectors
(define (addend s) (car s))
(define (augend s)
  (let ((res (cddr s)))
    (if (= (length res) 1) (car res) res)))
(define (multiplier s) (car s))
(define (multiplicand s)
  (let ((res (cddr s)))
    (if (or (= (length res) 1) (sum? res)) (car res) res)))
; Constructors
(define (make-sum a1 a2)
  (cond ((=number? a1 0) a2)
        ((=number? a2 0) a1)
        ((and (number? a1) (number? a2))
         (+ a1 a2))
        (else (list a1 '+ a2))))
(define (make-product m1 m2)
  (cond ((or (=number? m1 0) (=number? m2 0)) 0)
        ((=number? m1 1) m2)
        ((=number? m2 1) m1)
        ((and (number? m1) (number? m2)) (* m1 m2))
        ((sum? m2) (make-sum (make-product m1 (car m2)) (cdr m2)))
        (else (list m1 '* m2))))
#+end_src

#+name: test-solution-2.58-b
#+begin_src scheme
<<algebraic-expressions>>
<<drops-unnecessary-parentheses>>

(printf "~a~n" (deriv '(x + 3 * (x + y + 2)) 'x))
(printf "~a~n" (deriv '(x * 3 + y) 'x))
(printf "~a~n" (deriv '(x * 3 * y) 'x))
#+end_src

#+RESULTS: test-solution-2.58-b
: 4
: 3
: (3 * y)

*** Solution

#+name: element-of-set-procedure-unordered-list
#+begin_src scheme
(define (element-of-set? x set)
  (cond ((null? set) false)
        ((equal? x (car set)) true)
        (else (element-of-set? x (cdr set)))))
#+end_src

#+name: union-set-procedure-unordered-list
#+begin_src scheme
(define (union-set set1 set2)
  (cond ((null? set1) set2)
        ((null? set2) set1)
        ((element-of-set? (car set1) set2)
         (union-set (cdr set1) set2))
        (else (cons (car set1) (union-set (cdr set1) set2)))))
#+end_src

#+name: test-solution-2.59
#+begin_src scheme
<<element-of-set-procedure-unordered-list>>
<<union-set-procedure-unordered-list>>

(display (union-set '(3 2 1 4) '(8 6 4 5 2 7)))
#+end_src

#+RESULTS: test-solution-2.59
: (3 1 8 6 4 5 2 7)

*** Solution

#+name: element-of-set-duplicated-list
#+begin_src scheme
(define (element-of-set? x set)
  (cond ((null? set) false)
        ((equal? x (car set)) true)
        (else (element-of-set? x (cdr set)))))
#+end_src

#+name: adjoin-set-duplicated-list
#+begin_src scheme
(define adjoin-set cons)
#+end_src

#+name: union-set-duplicated-list
#+begin_src scheme
(define union-set append)
#+end_src

#+name: intersection-set-duplicated-list
#+begin_src scheme
(define (intersection-set set1 set2)
  (cond ((or (null? set1) (null? set2)) '())
        ((element-of-set? (car set1) set2)
         (cons (car set1) (intersection-set (cdr set1) set2)))
        (else (intersection-set (cdr set1) set2))))
#+end_src

#+name: test-solution-2.60
#+begin_src scheme
<<element-of-set-duplicated-list>>
<<intersection-set-duplicated-list>>

(display (intersection-set '(2 3 2 1 3 2 2) '(1 1 2 2 3 3 4 4)))
#+end_src

#+RESULTS: test-solution-2.60
: (2 3 2 1 3 2 2)

*** Solution

#+name: adjoin-set-ordered-list
#+begin_src scheme
(define (adjoin-set x set)
  (cond ((null? set) (list x))
        ((= x (car set)) set)
        ((< x (car set)) (cons x set))
        (else (cons (car set) (adjoin-set x (cdr set))))))
#+end_src

#+name: test-solution-2.61
#+begin_src scheme
<<adjoin-set-ordered-list>>

(printf "~a~n" (adjoin-set 1 '(2 3 4 5)))
(printf "~a~n" (adjoin-set 3 '(1 2 4 5)))
(printf "~a~n" (adjoin-set 5 '(1 2 3 4)))
#+end_src

#+RESULTS: test-solution-2.61
: (1 2 3 4 5)
: (1 2 3 4 5)
: (1 2 3 4 5)

*** Solution

#+name: union-set-ordered-list
#+begin_src scheme
(define (union-set set1 set2)
  (cond ((null? set1) set2)
        ((null? set2) set1)
        (else
         (let ((x1 (car set1)) (x2 (car set2)))
           (cond ((< x1 x2)
                  (cons x1 (union-set (cdr set1) set2)))
                 ((> x1 x2)
                  (cons x2 (union-set set1 (cdr set2))))
                 (else (cons x1 (union-set (cdr set1) (cdr set2)))))))))
#+end_src

#+name: test-solution-2.62
#+begin_src scheme
<<union-set-ordered-list>>

(printf "~a~n" (union-set '(1 2 3) '(4 5 6)))
(printf "~a~n" (union-set '(1 2 3 4 5 6) '(4 5 6 7 8 9)))
#+end_src

#+RESULTS: test-solution-2.62
: (1 2 3 4 5 6)
: (1 2 3 4 5 6 7 8 9)

**** Part a

Yes, both procedures will produce the same list for every tree. But the former is recursively and the latter is iterative.

Each tree in [[https://sarabander.github.io/sicp/html/2_002e3.xhtml#Figure-2_002e16][Figure 2.16]] can be represented as the list below respectively:

#+name: trees-in-figure-2-16
#+begin_src scheme
(define tree-fig-2-16-1 '(7 (3 (1 () ()) (5 () ())) (9 () (11 () ()))))
(define tree-fig-2-16-2 '(3 (1 () ()) (7 (5 () ()) (9 () (11 () ())))))
(define tree-fig-2-16-3 '(5 (3 (1 () ()) ()) (9 (7 () ()) (11 () ()))))
#+end_src

#+name: sets-via-tree-operations
#+begin_src scheme
(define entry car)
(define left-branch cadr)
(define right-branch caddr)
(define make-tree list)
#+end_src

#+name: convert-tree-to-list
#+begin_src scheme
<<tree-to-list-recursive>>
<<tree-to-list-iterative>>
<<trees-in-figure-2-16>>
<<sets-via-tree-operations>>

(printf "~a~n" (tree->list-1 tree-fig-2-16-1))
(printf "~a~n" (tree->list-2 tree-fig-2-16-1))
(newline)
(printf "~a~n" (tree->list-1 tree-fig-2-16-2))
(printf "~a~n" (tree->list-2 tree-fig-2-16-2))
(newline)
(printf "~a~n" (tree->list-1 tree-fig-2-16-3))
(printf "~a~n" (tree->list-2 tree-fig-2-16-3))
#+end_src

#+RESULTS: convert-tree-to-list
: (1 3 5 7 9 11)
: (1 3 5 7 9 11)
:
: (1 3 5 7 9 11)
: (1 3 5 7 9 11)
:
: (1 3 5 7 9 11)
: (1 3 5 7 9 11)

**** Part a

The ~partial-tree~ procedure takes $\frac{n-1}{2}$ elements of a list and generates the left subtree. And taking remaining elements to generate a node and the right subtree. Finally, using these three parts to make a tree contains all elements of the list.

#+begin_src scheme
<<sets-via-tree-operations>>
<<list-tree-procedure>>

(printf "~a~n" (list->tree '(1 3 5 7 9 11)))
#+end_src

#+RESULTS:
: (5 (1 () (3 () ())) (9 (7 () ()) (11 () ())))

#+begin_example
    5
   / \
  1   9
   \ / \
   3 7 11
#+end_example

*** Solution

#+name: union-set-binary-trees
#+begin_src scheme
<<sets-via-tree-operations>>
<<union-set-ordered-list>>
<<list-tree-procedure>>
<<tree-to-list-iterative>>

(define (union-set-trees set1 set2)
  (list->tree (union-set (tree->list-2 set1)
                         (tree->list-2 set2))))
#+end_src

#+name: test-solution-2.65
#+begin_src scheme
<<union-set-binary-trees>>

(display (union-set-trees (list->tree '(1 2 3 5 7 9 46))
                          (list->tree '(5 6 10 11 20 23 46))))
#+end_src

#+RESULTS: test-solution-2.65
: (7 (3 (1 () (2 () ())) (5 () (6 () ()))) (11 (9 () (10 () ())) (23 (20 () ()) (46 () ()))))

*** Solution

#+name: huffman-trees-operations
#+begin_src scheme
(define (make-leaf symbol weight) (list 'leaf symbol weight))
(define (leaf? object) (eq? (car object) 'leaf))
(define (symbol-leaf x) (cadr x))
(define (weight-leaf x) (caddr x))
(define (symbols tree)
  (if (leaf? tree)
      (list (symbol-leaf tree))
      (caddr tree)))
(define (weight tree)
  (if (leaf? tree)
      (weight-leaf tree)
      (cadddr tree)))
(define (make-code-tree left right)
  (list left
        right
        (append (symbols left) (symbols right))
        (+ (weight left) (weight right))))
(define (left-branch tree) (car tree))
(define (right-branch tree) (cadr tree))
(define (adjoin-set x set)
  (cond ((null? set) (list x))
        ((< (weight x) (weight (car set))) (cons x set))
        (else (cons (car set)
                    (adjoin-set x (cdr set))))))
(define (make-leaf-set pairs)
  (if (null? pairs)
      '()
      (let ((pair (car pairs)))
        (adjoin-set (make-leaf (car pair)    ; symbol
                               (cadr pair))  ; frequency
                    (make-leaf-set (cdr pairs))))))
#+end_src

#+name: decoding-procedure
#+begin_src scheme
(define (decode bits tree)
  (define (decode-1 bits current-branch)
    (if (null? bits)
        '()
        (let ((next-branch
               (choose-branch (car bits) current-branch)))
          (if (leaf? next-branch)
              (cons (symbol-leaf next-branch)
                    (decode-1 (cdr bits) tree))
              (decode-1 (cdr bits) next-branch)))))
  (decode-1 bits tree))
(define (choose-branch bit branch)
  (cond ((= bit 0) (left-branch branch))
        ((= bit 1) (right-branch branch))
        (else (error "bad bit:  CHOOSE-BRANCH" bit))))
#+end_src

#+begin_src scheme
<<huffman-trees-operations>>
<<decoding-procedure>>
<<sample-tree-definition>>

(display (decode sample-message sample-tree))
#+end_src

#+RESULTS:
: (A D A B B C A)

*** Solution

#+name: encode-symbol-procedure
#+begin_src scheme
(define (encode-symbol message tree)
  (if (leaf? tree)
      (if (eq? message (symbol-leaf tree))
          '()
          (error "bad message: ENCODE-SYMBOL" message))
      (let ((left (left-branch tree)))
        (if (memq message (symbols left))
            (cons 0 (encode-symbol message left))
            (cons 1 (encode-symbol message (right-branch tree)))))))
#+end_src

#+name: test-solution-2.68
#+begin_src scheme
<<huffman-trees-operations>>
<<sample-tree-definition>>
<<encoding-procedure>>
<<encode-symbol-procedure>>

(display (encode '(A D A B B C A) sample-tree))
#+end_src

#+RESULTS: test-solution-2.68
: (0 1 1 0 0 1 0 1 0 1 1 1 0)

*** Solution

#+name: successive-merge-procedure
#+begin_src scheme
(define (successive-merge leaves)
  (if (null? (cdr leaves))
      (car leaves)
      (successive-merge
       (adjoin-set (make-code-tree (car leaves) (cadr leaves)) (cddr leaves)))))
#+end_src

#+name: test-solution-2.69
#+begin_src scheme
<<huffman-trees-operations>>
<<generate-huffman-tree-procedure>>
<<successive-merge-procedure>>

(display (generate-huffman-tree '((A 8) (B 3) (C 1) (D 1) (E 1) (F 1) (G 1) (H 1))))
#+end_src

#+RESULTS: test-solution-2.69
: ((leaf A 8) ((((leaf H 1) (leaf G 1) (H G) 2) ((leaf F 1) (leaf E 1) (F E) 2) (H G F E) 4) (((leaf D 1) (leaf C 1) (D C) 2) (leaf B 3) (D C B) 5) (H G F E D C B) 9) (A H G F E D C B) 17)

*** Solution

#+begin_src scheme
<<huffman-trees-operations>>
<<encoding-procedure>>
<<encode-symbol-procedure>>
<<generate-huffman-tree-procedure>>
<<successive-merge-procedure>>

(define rock-tree (generate-huffman-tree '((A 2) (GET 2) (SHA 3) (WAH 1) (BOOM 1) (JOB 2) (NA 16) (YIP 9))))
(define rock-song '(GET A JOB SHA NA NA NA NA NA NA NA NA GET A JOB SHA NA NA NA NA NA NA NA NA WAH YIP YIP YIP YIP YIP YIP YIP YIP YIP SHA BOOM))
(define rock-encoded-song (encode rock-song rock-tree))
(printf "~a~n" rock-tree)
(printf "~a~n" rock-encoded-song)
(printf "Total bits: ~a~n" (length rock-encoded-song))
(printf "Fixed-length encoding bits: ~a~n" (* (log 8 2) (length rock-song)))
#+end_src

#+RESULTS:
: ((leaf NA 16) ((leaf YIP 9) (((leaf A 2) ((leaf BOOM 1) (leaf WAH 1) (BOOM WAH) 2) (A BOOM WAH) 4) ((leaf SHA 3) ((leaf JOB 2) (leaf GET 2) (JOB GET) 4) (SHA JOB GET) 7) (A BOOM WAH SHA JOB GET) 11) (YIP A BOOM WAH SHA JOB GET) 20) (NA YIP A BOOM WAH SHA JOB GET) 36)
: (1 1 1 1 1 1 1 0 0 1 1 1 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 0 0 1 1 1 1 0 1 1 1 0 0 0 0 0 0 0 0 0 1 1 0 1 1 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 0 1 1 1 0 1 1 0 1 0)
: Total bits: 84
: Fixed-length encoding bits: 108.0

*** Solution

#+name: raise-operation-procedure
#+begin_src scheme
(define (install-scheme-number-package)
  ...
  (put 'raise 'scheme-number
       (lambda (x) (make-rational x 1)))
  'done)
(define (install-rational-package)
  ...
  (put 'raise 'rational
       (lambda (x) (make-real (/ (numer x) (denom x)))))
  'done)
(define (install-real-package)
  ...
  (put 'raise 'real
       (lambda (x) (make-from-real-imag x 0)))
  'done)
(define (raise x) (apply-generic 'raise x))
#+end_src

#+RESULTS: raise-operation-procedure
: ...: ellipses not allowed as an expression
:   in: ...
:

